{
  "data": [
    {
      "content": "The Liberals are dropping a plan to add hundreds of firearms to a list of banned weapons in Canada as part of their broader promise to tighten gun laws in Canada. But they will try again to legislate a definition of what would constitute an illegal weapon in a move that is sure to reignite controversy around one of the most politically sensitive files on the government’s agenda.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "The definition is expected to be part of a new package of amendments that could land within days as the legislative clock on the federal government’s latest effort to tighten gun laws — Bill C-21 — is running out.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "C-21 had started out as a bill to implement a freeze on the sale of handguns, increase penalties for gun crimes and implement other gun-related measures.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "The issue nearly derailed the NDP and Liberals supply-and-confidence deal.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "Since the February climbdown, Mendicino has been criss-crossing the country meeting with Indigenous leaders, rural leaders, hunters and sports shooting enthusiasts to help fine-tune what he has repeatedly called the Liberal government’s efforts to legislate the strongest gun reform in a generation.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "The Liberals are also planning a run of gun-control-related announcements over the coming days to signal they’ve not lost their appetite for moving ahead on restrictions.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "Both the Bloc Québécois and New Democrats are involved in the talks — with a minority government, the Liberals need the support of at least one party to pass the bill.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "Bloc MP Kristina Michaud, who has been lauded by gun control advocates for her work advancing tougher measures, said her party is ready to work with the Liberals.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "The NDP showed its hand on one element of the plan earlier Tuesday, saying it wants amendments introduced that would bring gun makers into the discussion and have them barred from making certain kinds of weapons.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "Singh said how the Liberals had approached the issue previously didn’t work and his party doesn’t want to see a repeat.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "For the Opposition Conservatives, the ask is simple: pull the bill, which they consider flawed and full of provisions that won’t combat gun crime, which the Tories say should be the focus of the government.",
      "title": "Trudeau’s Liberals abandon plan to expand banned guns list — but new amendments are coming",
      "link": "https://www.thestar.com/politics/federal/2023/04/25/trudeaus-liberals-abandon-plan-to-expand-banned-guns-list-but-new-amendments-are-coming.html?rf"
    },
    {
      "content": "Canada has withdrawn proposed amendments to gun legislation that would have banned certain types of rifles and shotguns, after opponents alleged the prohibitions unfairly targeted farmers and hunters.",
      "title": "Canada withdraws proposed gun ban amendments",
      "link": "https://www.reuters.com/world/americas/canada-withdraws-proposed-measures-banning-certain-rifles-shotguns-2023-02-03/"
    },
    {
      "content": "Canada has stricter gun laws than the United States, but Canadians can own firearms with a license. Some firearms must also be registered, though not most long guns: rifles and shotguns.",
      "title": "Comparison of gun laws between Canada and the United States",
      "link": "https://www.reuters.com/world/americas/canada-withdraws-proposed-measures-banning-certain-rifles-shotguns-2023-02-03/"
    },
    {
      "content": "Canada's gun homicide rate is a fraction of the United States' rate, 2020 data showed, but is still higher than other wealthy countries and has been rising, with handguns the main weapon used in the majority of firearm-related violent crimes between 2009 and 2020.",
      "title": "Gun homicide rate in Canada compared to other countries",
      "link": "https://www.reuters.com/world/americas/canada-withdraws-proposed-measures-banning-certain-rifles-shotguns-2023-02-03/"
    },
    {
      "content": "Crime rates have been increasing in Canada over the past 3 years, with drug use and property crimes being the most prevalent issues. However, the safety index for walking alone during daylight is perceived as high, while the safety index for walking alone during night is moderate. The crime index varies by city, with Surrey having the highest crime index and Quebec City having the lowest.",
      "title": "Crime Rates and Safety Index in Canada by City",
      "link": "https://www.numbeo.com/crime/country_result.jsp?country=Canada"
    },
    {
      "content": "According to statistics, the most common crimes in Canada include theft, break-ins, and drug-related offenses. In 2023, the crime rate in Canada was classified as moderate, with a score of 48.33. Additionally, the issue of corruption and bribery is perceived as low in the country.",
      "title": "Common Crimes and Corruption in Canada",
      "link": "https://www.numbeo.com/crime/country_result.jsp?country=Canada"
    },
    {
      "content": "There is a moderate level of worry among Canadians regarding home break-ins and stolen property, as well as being insulted. However, the level of worry for being mugged or robbed is low. The data is based on perceptions of visitors of a website over the past 3 years.",
      "title": "Perceived Worries of Crime in Canada",
      "link": "https://www.numbeo.com/crime/country_result.jsp?country=Canada"
    },
    {
      "content": "Canada has a relatively low crime rate compared to other countries, with a country-wide Crime Severity Index (CSI) of 73.1 in 2021. However, eight Canadian cities are listed among the top 100 cities in the world with the highest crime index, including Surrey, Lethbridge, Kelowna, Red Deer, Sudbury, Oshawa, Sault Ste. Marie, and Winnipeg. The most common crimes reported in these cities include drug-related offenses, theft, vandalism, and assault.",
      "title": "Canada's Most Dangerous Cities: Statistics and Data",
      "link": "https://immigrationnewscanada.ca/most-dangerous-cities-in-canada/"
    },
    {
      "content": "According to Statistics Canada, the overall crime rate in Canada has decreased by 8% from 2019 to 2020. However, the rate of violent crimes has remained stable. In 2020, there were 437 homicides reported in Canada, which is a slight decrease from the previous year. The most common type of homicide was committed with a firearm.",
      "title": "Statistics Canada Reports on Homicide and Violent Crime Rates in Canada",
      "link": "https://immigrationnewscanada.ca/most-dangerous-cities-in-canada/"
    },
    {
      "content": "The Canadian Centre for Justice Statistics reports that Indigenous people are overrepresented in Canada's prison population. In 2018-2019, Indigenous people accounted for 30% of admissions to provincial and territorial custody, despite making up only 5% of the Canadian population. Indigenous people were also more likely to be held in remand and less likely to be granted bail than non-Indigenous people.",
      "title": "Indigenous Overrepresentation in Canadian Prisons: Data and Information",
      "link": "https://immigrationnewscanada.ca/most-dangerous-cities-in-canada/"
    },
    {
      "content": "In 2020, the Government of Canada banned assault-style firearms.",
      "title": "Canada bans assault-style firearms",
      "link": "https://www.canada.ca/en/public-safety-canada/news/2023/05/government-announces-strengthened-measures-to-prevent-gun-violence-and-ban-new-assault-style-firearms.html"
    },
    {
      "content": "Bill C-21, Canada's strong gun control legislation, would implement a national freeze on handguns into law, address the role of firearms in domestic violence, and take aim at organized crime.",
      "title": "Bill C-21: Canada's Strong Gun Control Legislation",
      "link": "https://www.canada.ca/en/public-safety-canada/news/2023/05/government-announces-strengthened-measures-to-prevent-gun-violence-and-ban-new-assault-style-firearms.html"
    },
    {
      "content": "The proposed legislative measures would establish a new technical definition of assault-style firearms, require manufacturers to seek a Firearms Reference Table number before selling in Canada, and tackle the issue of ghost guns.",
      "title": "Proposed Legislative Measures to Strengthen Canada's Gun Control Laws",
      "link": "https://www.canada.ca/en/public-safety-canada/news/2023/05/government-announces-strengthened-measures-to-prevent-gun-violence-and-ban-new-assault-style-firearms.html"
    },
    {
      "content": "From 2021 to 2022, the Canada Border Services Agency seized more than 1,200 firearms, the largest number of seizures recorded in a single year.",
      "title": "Canada Border Services Agency Seizes Over 1,200 Firearms",
      "link": "https://www.canada.ca/en/public-safety-canada/news/2023/05/government-announces-strengthened-measures-to-prevent-gun-violence-and-ban-new-assault-style-firearms.html"
    },
    {
      "content": "In Budget 2021, the Government announced an investment of $312 million over five years to increase law enforcement capacity to combat firearms smuggling and trafficking.",
      "title": "Government Invests $312 Million to Combat Firearms Smuggling and Trafficking",
      "link": "https://www.canada.ca/en/public-safety-canada/news/2023/05/government-announces-strengthened-measures-to-prevent-gun-violence-and-ban-new-assault-style-firearms.html"
    },
    {
      "content": "The Government of Canada has prohibited over 1,500 models of assault-style firearms and certain components of some newly prohibited firearms.",
      "title": "Prohibition on assault-style firearms",
      "link": "https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx"
    },
    {
      "content": "Bill C-21 is part of a comprehensive strategy to address gun violence and strengthen gun control in Canada.",
      "title": "Bill C-21: An Act to amend certain Acts and to make certain consequential amendments (firearms) and regulatory amendments",
      "link": "https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx"
    },
    {
      "content": "An Act to amend certain Acts and Regulations in relation to firearms (former Bill C-71) prioritizes public safety and effective police work, while respecting responsible firearms owners.",
      "title": "Former Bill C-71, An Act to Amend certain Acts and Regulations in relation to firearms",
      "link": "https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx"
    },
    {
      "content": "Additional Regulations for licence verification and business record-keeping for non-restricted firearms came into force on May 18, 2022.",
      "title": "Additional Regulations for licence verification and business record-keeping",
      "link": "https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx"
    },
    {
      "content": "Regulations to expand background checks to cover the lifetime of an applicant and re-instatement of a requirement to apply for an Authorization to Transport to some places came into force in July 2021.",
      "title": "Regulations to expand background checks",
      "link": "https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx"
    },
    {
      "content": "The Government of Canada announced $390 million to help stop crime and violence on May 8, 2023.",
      "title": "Government announces $390 million to help stop crime and violence",
      "link": "https://www.publicsafety.gc.ca/cnt/cntrng-crm/frrms/index-en.aspx"
    },
    {
      "content": "Canada’s national homicide rate increased for a third consecutive year in 2021, with nearly one-quarter of the killings connected to gangs.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "184 of 788 murders in the country were gang-related, up from 151 in 2020, which represented about 20 per cent of all the deaths.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Ontario’s gang-related homicides were also up in 2021, to 65, which was 13 more than those counted in 2020.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Ontario had 114 gun-related homicides last year, with just eight of those in Hamilton.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Saskatchewan had the highest rate of gang-related killings, 25, representing 35.7 per cent of its homicides recorded in 2021.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Homicides in general in Canada are still rare, according to the StatCan report, with murders accounting for less than 0.2 per cent of all police-reported violent crimes.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Niagara’s police board painted a picture of how street gangs operate in southern Ontario, documenting 159 members travelling regularly between Niagara and Toronto.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Niagara regional police Staff Sgt. Matt Hodges told the board Friday the gangs primarily originate from the GTA, with a small number tied to Montreal and Nova Scotia.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Drug trafficking, human trafficking and firearm-related matters are the primary activities the gangs are involved in on a day-to-day basis.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "Overall, Niagara Region had six homicides in 2021, up from one in 2020.",
      "title": "Gang-related homicide rate up countrywide and in Ontario: StatCan",
      "link": "https://globalnews.ca/news/9296704/gang-homicide-rate-up-canada-ontario-statcan/"
    },
    {
      "content": "There were more than 80 murders in the Lower Mainland region of British Columbia in 2022.",
      "title": "80 murders in Lower Mainland region in 2022",
      "link": "https://vancouversun.com/news/crime/gang-murders-down-in-2022-but-still-a-busy-year-for-homicide-squads"
    },
    {
      "content": "75 of the victims died in jurisdictions policed by the Integrated Homicide Investigation Team, while 13 were in Vancouver and handled by the Vancouver Police Department.",
      "title": "75 murders investigated by Integrated Homicide Investigation Team in 2022",
      "link": "https://vancouversun.com/news/crime/gang-murders-down-in-2022-but-still-a-busy-year-for-homicide-squads"
    },
    {
      "content": "There were fewer gang murders in 2022 than there were in 2021, although several others not classified as gang cases had links to organized crime or the drug trade.",
      "title": "Fewer gang murders in 2022 than in 2021",
      "link": "https://vancouversun.com/news/crime/gang-murders-down-in-2022-but-still-a-busy-year-for-homicide-squads"
    },
    {
      "content": "Murders in Vancouver were down from 18 victims in 2021 to 13 last year.",
      "title": "Murders in Vancouver down in 2022",
      "link": "https://vancouversun.com/news/crime/gang-murders-down-in-2022-but-still-a-busy-year-for-homicide-squads"
    },
    {
      "content": "The number of targeted murders connected to the ongoing Lower Mainland gang conflict was down from the previous year.",
      "title": "Fewer targeted murders in Lower Mainland gang conflict in 2022",
      "link": "https://vancouversun.com/news/crime/gang-murders-down-in-2022-but-still-a-busy-year-for-homicide-squads"
    },
    {
      "content": "Between 2017 and 2021, there were a total of 3,465 homicide victims in Canada, out of which 815 were linked or suspected to be linked to organized crime or a street gang.",
      "title": "Number of homicide victims linked to organized crime or street gangs in Canada",
      "link": "https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=3510007501"
    },
    {
      "content": "The percentage of homicide victims linked to organized crime or street gangs out of the total number of homicide victims for which the link was known ranged from 19.92% in 2020 to 24.44% in 2017.",
      "title": "Percentage of homicide victims linked to organized crime or street gangs in Canada",
      "link": "https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=3510007501"
    },
    {
      "content": "The rate of homicides linked or suspected to be linked to organized crime or street gangs per 100,000 population ranged from 0.40 in 2020 to 0.48 in 2021.",
      "title": "Rate of homicides linked to organized crime or street gangs per 100,000 population in Canada",
      "link": "https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=3510007501"
    },
    {
      "content": "More than six out of ten Indigenous women reported experiencing physical or sexual assault at some point in their lifetime, according to new data released by Statistics Canada in May.",
      "title": "Violence against Indigenous Women and Girls",
      "link": "https://www.hrw.org/world-report/2022/country-chapters/canada"
    },
    {
      "content": "Canada continues to detain people on immigration grounds in often abusive conditions, according to a joint Human Rights Watch and Amnesty International report released in June.",
      "title": "Immigration Detention",
      "link": "https://www.hrw.org/world-report/2022/country-chapters/canada"
    },
    {
      "content": "Canada has consistently failed to implement promised reforms to hold Canadian mining companies accountable for abuses committed abroad, despite being home to half of the world’s mining companies.",
      "title": "Corporate Accountability",
      "link": "https://www.hrw.org/world-report/2022/country-chapters/canada"
    },
    {
      "content": "Nearly four dozen Canadian men, women, and children remain unlawfully and indefinitely detained in northeast Syria in locked desert camps and prisons for Islamic State (ISIS) suspects and their families.",
      "title": "Counterterrorism",
      "link": "https://www.hrw.org/world-report/2022/country-chapters/canada"
    },
    {
      "content": "Inadequate access to clean, safe drinking water continues to pose a major public health concern in many Indigenous communities in Canada.",
      "title": "Rights of Indigenous Peoples",
      "link": "https://www.hrw.org/world-report/2022/country-chapters/canada"
    },
    {
      "content": "2020 was the deadliest year for overdose deaths in Canada since it started recording the numbers in 2016. From January 2020 to June 2021, more than 9,800 Canadians died from an opioid overdose. (source: CBC News)",
      "title": "Canada's deadliest year for overdose deaths",
      "link": "https://www.cbc.ca/news/canada/canada-illicit-drug-supply-explainer-1.6361623"
    },
    {
      "content": "69% of opioids seized by law enforcement agencies across Canada in 2020 consisted of fentanyl or fentanyl analogues, according to Health Canada's Drug Analysis Service (DAS). (source: CBC News)",
      "title": "69% of opioids seized in Canada are fentanyl or its analogues",
      "link": "https://www.cbc.ca/news/canada/canada-illicit-drug-supply-explainer-1.6361623"
    },
    {
      "content": "The number of drug samples in which benzodiazepines were detected in B.C. went from 15% to 53% in a little more than a year, according to a recent report by the B.C. Coroner Service. (source: CBC News)",
      "title": "Increase in benzodiazepines in illicit drug supply",
      "link": "https://www.cbc.ca/news/canada/canada-illicit-drug-supply-explainer-1.6361623"
    },
    {
      "content": "Since 2008, more than 1,000 new psychoactive substances have been reported to the United Nations Office on Drugs and Crime (UNODC). (source: CBC News)",
      "title": "Over 1,000 new psychoactive substances reported to UNODC since 2008",
      "link": "https://www.cbc.ca/news/canada/canada-illicit-drug-supply-explainer-1.6361623"
    },
    {
      "content": "The rise of cryptocurrencies and the dark web have made it easier to sell drugs anonymously. (source: CBC News)",
      "title": "Cryptocurrencies and the dark web in drug trade",
      "link": "https://www.cbc.ca/news/canada/canada-illicit-drug-supply-explainer-1.6361623"
    },
    {
      "content": "Naloxone, a fast-acting antidote that reverses the effects of an opioid overdose, doesn't act on benzodiazepines or most other synthetic substances found mixed in with opioids. (source: CBC News)",
      "title": "Naloxone does not act on benzodiazepines",
      "link": "https://www.cbc.ca/news/canada/canada-illicit-drug-supply-explainer-1.6361623"
    },
    {
      "title": "Toronto records zero gun deaths so far in 2023 as compared to 13 last year",
      "content": "At this time last year, Toronto recorded 66 shootings, out of which 13 were fatal. In 2023, so far, there have been 19 shootings — and none has been fatal. According to Louis March, founder of the Zero Gun Violence Movement, the decline can be attributed to strong government control and the disruption of illegal guns coming in from across the border.",
      "link": "https://ca.style.yahoo.com/toronto-violence-gun-deaths-2023-185611550.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAC14k_awlc_zVKu0EvmWPOZ5FxKRxZkRMlqHWKTiHlZy70pR-7GQ8B5xd090BcQNXfrmLONqRc2hopp1o2x-Pt1vvnSI6vSezE1ChfT1y2Wb5WOXUhxL6jMr04UYO_YcKnubK6LsOZU7fRPTI_PRH6QlWf_sbilA6t1pPAjRk4Sa1"
    },
    {
      "title": "Canada Border Services Agency arrests a man for smuggling firearms",
      "content": "Recently, the Canada Border Services Agency lay charges in a firearm investigation and arrested a 30-year-old man for smuggling firearms. This was a part of the efforts to disrupt the flow of illegal guns coming in from across the border. ",
      "link": "https://ca.style.yahoo.com/toronto-violence-gun-deaths-2023-185611550.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAC14k_awlc_zVKu0EvmWPOZ5FxKRxZkRMlqHWKTiHlZy70pR-7GQ8B5xd090BcQNXfrmLONqRc2hopp1o2x-Pt1vvnSI6vSezE1ChfT1y2Wb5WOXUhxL6jMr04UYO_YcKnubK6LsOZU7fRPTI_PRH6QlWf_sbilA6t1pPAjRk4Sa1"
    },
    {
      "title": "Bill C-21 bans 1,500 models and variants of firearms",
      "content": "In 2022, the Liberal government's Bill C-21 banned some 1,500 models and variants of firearms, including the AR-15 and Ruger Mini-14 on the grounds that they have no place in hunting or sports. Moreover, Trudeau announced that the government is looking at a 'variety of options' to carry out a buyback of banned firearms after the government estimated that there are approximately 150,000 registered firearms in Canada that would be bought back.",
      "link": "https://ca.style.yahoo.com/toronto-violence-gun-deaths-2023-185611550.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAC14k_awlc_zVKu0EvmWPOZ5FxKRxZkRMlqHWKTiHlZy70pR-7GQ8B5xd090BcQNXfrmLONqRc2hopp1o2x-Pt1vvnSI6vSezE1ChfT1y2Wb5WOXUhxL6jMr04UYO_YcKnubK6LsOZU7fRPTI_PRH6QlWf_sbilA6t1pPAjRk4Sa1"
    },
    {
      "title": "Poverty contributes to gun violence in Canada",
      "content": "Most of the gun violence, or criminal activity, is mostly in neighbourhoods where poverty is one of the biggest challenges. People can get involved in criminal activity because they don't see an alternative, especially in populations that are 'stigmatized, denied access, denied opportunity, denied education, or denied employment.' According to Jackie Sultana Sikdar, a second-year PhD student at York University, there are too many obstacles and limitations in terms of cultural, social, and economic spheres that contribute to crime — including gun violence.",
      "link": "https://ca.style.yahoo.com/toronto-violence-gun-deaths-2023-185611550.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAC14k_awlc_zVKu0EvmWPOZ5FxKRxZkRMlqHWKTiHlZy70pR-7GQ8B5xd090BcQNXfrmLONqRc2hopp1o2x-Pt1vvnSI6vSezE1ChfT1y2Wb5WOXUhxL6jMr04UYO_YcKnubK6LsOZU7fRPTI_PRH6QlWf_sbilA6t1pPAjRk4Sa1"
    },
    {
      "title": "Community organizations can help reduce gun violence in Canada",
      "content": "According to March and Sikdar, more mobilization in the community combined with policing and government policies can work together like pieces of a 'jigsaw puzzle' to reduce gun violence in cities. Nonprofit organizations are fostering strong social networks, empowering people to work together, and keeping their own community safe. These organizations are influencing the needed systemic changes.",
      "link": "https://ca.style.yahoo.com/toronto-violence-gun-deaths-2023-185611550.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAC14k_awlc_zVKu0EvmWPOZ5FxKRxZkRMlqHWKTiHlZy70pR-7GQ8B5xd090BcQNXfrmLONqRc2hopp1o2x-Pt1vvnSI6vSezE1ChfT1y2Wb5WOXUhxL6jMr04UYO_YcKnubK6LsOZU7fRPTI_PRH6QlWf_sbilA6t1pPAjRk4Sa1"
    },
    {
      "content": "As of Sept. 19, Toronto police have recorded 31 homicides by shootings out of a total of 302 shootings so far this year.",
      "title": "31 homicides by shootings in Toronto so far this year",
      "link": "https://www.cbc.ca/news/canada/toronto/anti-gun-violence-protest-2022-1.6594870"
    },
    {
      "content": "Numbers from Statistics Canada show the number of homicides committed by shootings has increased every year since 2018.",
      "title": "Homicides committed by shootings in Canada on the rise since 2018",
      "link": "https://www.cbc.ca/news/canada/toronto/anti-gun-violence-protest-2022-1.6594870"
    },
    {
      "content": "In 2017 there were 392 shootings and firearm discharges, with more than 400 recorded in each of the following years up to 2021.",
      "title": "400+ shootings per year recorded in Toronto from 2017-2021",
      "link": "https://www.cbc.ca/news/canada/toronto/anti-gun-violence-protest-2022-1.6594870"
    },
    {
      "content": "Gun violence is trending younger in Toronto, with teenagers carrying and using guns in public spaces.",
      "title": "Teenagers carrying guns in Toronto",
      "link": "https://www.cbc.ca/news/canada/toronto/anti-gun-violence-protest-2022-1.6594870"
    },
    {
      "content": "Toronto has allocated $12 million this year to develop a new approach to gun violence and mental health calls.",
      "title": "Toronto allocates $12 million to address gun violence and mental health",
      "link": "https://www.cbc.ca/news/canada/toronto/anti-gun-violence-protest-2022-1.6594870"
    },
    {
      "content": "Toronto Police Services reports that as of October 2022, 13% of all municipal gun violence incidents in Toronto not involving police have resulted in homicide.",
      "title": "Toronto Police Services report 13% of non-police involved gun violence results in homicide",
      "link": "https://www.excal.on.ca/news/2022/10/17/how-do-you-solve-a-problem-like-gun-violence/"
    },
    {
      "content": "Over 300 shootings have occurred in Toronto in 2022, reflecting similar levels of activity since 2018, and expected to surpass 2021's total.",
      "title": "Over 300 shootings in Toronto in 2022",
      "link": "https://www.excal.on.ca/news/2022/10/17/how-do-you-solve-a-problem-like-gun-violence/"
    },
    {
      "content": "The federal government's inability to secure borders against gun smuggling contributes to the gun problem, according to Louis March of the Zero Gun Violence Movement.",
      "title": "Louis March attributes gun problem to Canada's federal government's inability to secure borders against gun smuggling",
      "link": "https://www.excal.on.ca/news/2022/10/17/how-do-you-solve-a-problem-like-gun-violence/"
    },
    {
      "content": "Marcel Wilson of the One by One Movement identifies social media cyberbullying as a factor in real life violence among young people.",
      "title": "Marcel Wilson identifies social media as contributing to real life violence among young people",
      "link": "https://www.excal.on.ca/news/2022/10/17/how-do-you-solve-a-problem-like-gun-violence/"
    },
    {
      "content": "Illegal, non-registered firearms are the real problem, according to Louis March of the Zero Gun Violence Movement.",
      "title": "Louis March: Illegal non-registered firearms are the real problem",
      "link": "https://www.excal.on.ca/news/2022/10/17/how-do-you-solve-a-problem-like-gun-violence/"
    },
    {
      "content": "Advocacy and engagement are key to making a difference in Toronto's gun violence problem, says Louis March of the Zero Gun Violence Movement.",
      "title": "Louis March emphasizes advocacy and engagement to address Toronto's gun violence problem",
      "link": "https://www.excal.on.ca/news/2022/10/17/how-do-you-solve-a-problem-like-gun-violence/"
    },
    {
      "content": "Shootings were up 47.7% compared to this time last year, the number of people injured is up 70.6%, the number of people fatally shot is up by 33.3% and the total number of people injured and killed by gunfire is up 57.7%",
      "title": "Gun violence in Toronto is skyrocketing — again",
      "link": "https://torontosun.com/opinion/columnists/goldstein-gun-violence-in-toronto-is-skyrocketing-again"
    },
    {
      "content": "The average age of those involved in gun violence has dropped from 25 to 20 in the last five years.",
      "title": "Gun violence in Toronto is skyrocketing — again",
      "link": "https://torontosun.com/opinion/columnists/goldstein-gun-violence-in-toronto-is-skyrocketing-again"
    },
    {
      "content": "Police say the number of shell casings they’re recovering from shooting scenes is up by 50% from last year, meaning criminals are using guns with larger magazines or the guns have been converted to rapid fire.",
      "title": "Gun violence in Toronto is skyrocketing — again",
      "link": "https://torontosun.com/opinion/columnists/goldstein-gun-violence-in-toronto-is-skyrocketing-again"
    },
    {
      "content": "In 2021, there were 408 shootings, 163 injured, 46 killed.",
      "title": "GOLDSTEIN: Toronto gun violence skyrockets; no politician will say why",
      "link": "https://torontosun.com/opinion/columnists/goldstein-gun-violence-in-toronto-is-skyrocketing-again"
    },
    {
      "content": "The tide of illegal guns, mostly from the U.S., is fueling Toronto's gun violence surge",
      "title": "Cops say the tide of illegal guns, mostly from the U.S., fuelling Toronto's gun violence surge",
      "link": "https://torontosun.com/opinion/columnists/goldstein-gun-violence-in-toronto-is-skyrocketing-again"
    },
    {
      "content": "Father's Day saw four separate shootings in Toronto within a six-hour time span, showcasing the concerning trend of youth involvement in gun-related incidents.",
      "title": "Toronto's gun violence problem involves youth gangs",
      "link": "https://thevarsity.ca/2022/08/15/opinion-gun-violence-in-toronto-is-not-just-a-gun-control-problem/"
    },
    {
      "content": "Toronto's proximity to the US border is to blame for the ease through which guns can be smuggled into the city.",
      "title": "US-Canada border exacerbates Toronto's gun violence problem",
      "link": "https://thevarsity.ca/2022/08/15/opinion-gun-violence-in-toronto-is-not-just-a-gun-control-problem/"
    },
    {
      "content": "Neighbourhoods with a high presence of youth gangs and instances of youth-gang violence all exhibit similar characteristics including systemic poverty, racism, high rates of mental health issues, substance use disorders, and social isolation from other neighbourhoods.",
      "title": "Toronto's gun violence is linked to systemic social issues",
      "link": "https://thevarsity.ca/2022/08/15/opinion-gun-violence-in-toronto-is-not-just-a-gun-control-problem/"
    },
    {
      "content": "Toronto's public housing projects have failed in design and lack resources including accessible mental health and addiction treatment centres, leading to social isolation and marginalization of youth who then turn to gangs as a means of emotional, physical, and social survival.",
      "title": "Toronto's public housing projects contribute to gun violence",
      "link": "https://thevarsity.ca/2022/08/15/opinion-gun-violence-in-toronto-is-not-just-a-gun-control-problem/"
    },
    {
      "content": "The City's ongoing ignorance regarding the well-being of both areas and their residents allows for gang violence to continue, and a social and community-focused solution should be implemented instead of a policing solution.",
      "title": "Toronto's gun violence problem requires a social and community-focused solution",
      "link": "https://thevarsity.ca/2022/08/15/opinion-gun-violence-in-toronto-is-not-just-a-gun-control-problem/"
    },
    {
      "content": "Two men were killed and two others were injured in a targeted shooting in Oakville, Ontario. The police have identified the victims as Afheed (Al) Rehmtulla, 43, and Kareem Wade, 34. The investigation is still ongoing and no arrests have been made.",
      "title": "Two dead and two injured in targeted shooting in Oakville parking lot",
      "link": "https://www.cbc.ca/news/canada/toronto/two-men-killed-oakville-parking-lot-identified-1.5574024"
    },
    {
      "content": "The shooting occurred outside PurePages on Iroquois Shore Road near Eighth Line. The police are urging anyone with dashboard camera video or home/business surveillance video from the area between midnight and 3:30 a.m. on Saturday to come forward. They are also seeking information about a white sedan seen in the area at the time.",
      "title": "Police seek more information about targeted shooting in Oakville parking lot",
      "link": "https://www.cbc.ca/news/canada/toronto/two-men-killed-oakville-parking-lot-identified-1.5574024"
    },
    {
      "content": "The families of the two men who died have requested privacy during this difficult time. The police have extended their sympathies to the families and friends of the deceased.",
      "title": "Police extend sympathies to families of two men killed in Oakville shooting",
      "link": "https://www.cbc.ca/news/canada/toronto/two-men-killed-oakville-parking-lot-identified-1.5574024"
    },
    {
      "content": "Canada has the fifth highest rate of gun ownership in the world.",
      "title": "Canada has the fifth highest rate of gun ownership in the world",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Canada now has the third highest rate of firearm homicide among populous high-income countries, after the U.S. and Chile.",
      "title": "Canada has the third highest rate of firearm homicide among populous high-income countries",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Canada has experienced 15 mass shooting events in the past decade.",
      "title": "Canada has experienced 15 mass shooting events in the past decade",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Assault weapons are designed to inflict maximal harm to the human body in minimal time.",
      "title": "Assault weapons are designed to inflict maximal harm to the human body in minimal time",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Most Canadians support strong gun control laws.",
      "title": "Most Canadians support strong gun control laws",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "82% of Canadians favor a complete prohibition on military-style assault weapons.",
      "title": "82% of Canadians favor a complete prohibition on military-style assault weapons",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Assault weapon bans decrease both the overall number of mass shootings and per-event fatalities and injuries.",
      "title": "Assault weapon bans decrease both the overall number of mass shootings and per-event fatalities and injuries",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Comprehensive bans on weapons that can injure and kill many people in a short period of time can and do save lives.",
      "title": "Comprehensive bans on weapons that can injure and kill many people in a short period of time can and do save lives",
      "link": "https://time.com/6258603/canada-gun-violence-rise-us/"
    },
    {
      "content": "Since 2009, there has been an 81% increase in violent offenses involving guns in Canada.",
      "title": "Increase in violent offenses involving guns since 2009",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "One in three homicides in Canada are firearm-related.",
      "title": "One in three homicides in Canada are firearm-related",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "47% of Canadians feel gun violence is a threat to their community.",
      "title": "47% of Canadians feel gun violence is a threat to their community",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "Gun violence affects people and communities across Canada, regardless of age, socio-economic status, or gun ownership.",
      "title": "Gun violence affects people and communities across Canada",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "Women and girls, visible minorities, LGBTQ2 people, children and youth, lower income families, and those living in poverty are disproportionately affected by gun violence in Canada.",
      "title": "Disproportionate impact of gun violence on certain groups in Canada",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "Canada is taking action to address gun violence through strengthening gun laws and enforcement, securing borders, limiting access to assault-style firearms, and investing in prevention and enforcement efforts.",
      "title": "Canada's actions to address gun violence",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "Straw purchasing, theft, and smuggling are the main ways guns end up in the hands of criminals in Canada.",
      "title": "How guns can be diverted and end up in violent crime",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    },
    {
      "content": "Straw purchasing, which is when a firearm license-holder legally buys a gun and then illegally resells it on the black market, is on the rise in Canada.",
      "title": "Rise of straw purchasing in Canada",
      "link": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms.html"
    }
  ]
}
